OdDAI.Repository.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSmartPtr&lt;OdDAI.Schema&gt;!System.Runtime.CompilerServices.IsConst)
\details
Creates the repository from a STEP Physical File (*.spf) with specified schema.
\param fileName [in] A string that contains the file name.
\param schema [in] valid smart pointer to schema
\returns eOk if the data content was successfully read; otherwise, the method returns an appropriate error code.

OdDAI.Repository.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates the repository from a STEP Physical File (*.spf) with specified schema.
\param fileName [in] A string that contains the file name.
\param schemaName [in] valid schema name
\returns eOk if the data content was successfully read; otherwise, the method returns an appropriate error code.